# deps: general
brew "java"

# deps: postgis deps
brew "proj"
brew "geos"
brew "gdal"
brew "protobuf-c"
brew "sfcgal"
brew "bat"

# Utilities
brew "git"
brew "ripgrep"
brew "coreutils"
brew "fd"
brew "fzf"

# Environment
brew "direnv"

# terminal
brew "eza"
cask "kitty"
brew "zsh"
brew "neovim"

# Window management
cask "nikitabobko/tap/aerospace"
cask "deskpad"

# Task bar manager
cask "jordanbaird-ice"

# Recast
cask "raycast"

