# deps: general
brew "java"

# deps: postgis deps
brew "proj"
brew "geos"
brew "gdal"
brew "protobuf-c"
brew "sfcgal"
brew "bat"

# deps: postgres
brew "readline" 
brew "zlib" 
brew "curl" 
brew "ossp-uuid" 
brew "icu4c" 
brew "pkg-config"
brew "pgvector"

# Utilities
brew "git"
brew "gh"
brew "ripgrep"
brew "coreutils"
brew "fd"
brew "fzf"

# Fly.io
brew "flyctl"

# Database
brew "postgis"
brew "postgresql@16"
brew "mysql"

# Environment
brew "direnv"

# Zed
cask "zed@preview"

# terminal & neovim
brew "eza"
cask "kitty"
brew "zsh"
brew "neovim"

# Window management
cask "nikitabobko/tap/aerospace"
cask "deskpad"

# Task bar manager
cask "jordanbaird-ice"

# Apps
cask "raycast"
cask "discord"
cask "slack"
cask "cleanshot"
