# deps: general
brew "java"
brew "cmake"

# deps: postgis deps
brew "proj"
brew "geos"
brew "gdal"
brew "protobuf-c"
brew "sfcgal"
brew "bat"

# ai
tap "sst/tap"
cask "claude-code"
brew "sst/tap/opencode"

# deps: postgres
brew "readline"
brew "zlib"
brew "curl"
brew "ossp-uuid"
brew "icu4c"
brew "pkg-config"
brew "pgvector"

# Utilities
brew "git"
brew "gh"
brew "ripgrep"
brew "coreutils"
brew "fd"
brew "fzf"
brew "imagemagick"
brew "lua"
cask "ngrok"
cask "1password-cli"

# Fly.io
brew "flyctl"

# Database
brew "postgis"
brew "postgresql@17"
brew "mysql"

# Environment
brew "direnv"
brew "mise"

# Zed
cask "zed@preview"

# terminal & neovim
brew "eza"
brew "tmux"
cask "kitty"
cask "ghostty"
cask "wezterm"
brew "zsh"
brew "nushell"
brew "starship"
brew "neovim"
brew "cbonsai" # used for dashboard
brew "luarocks" # used for formatting lua
brew "lazygit" # TUI git terminal
brew "superfile" # TUI file manager
brew "yazi"
brew "rainfrog"

# Window management
cask "nikitabobko/tap/aerospace"
cask "hammerspoon"
cask "deskpad"

# Task bar manager
cask "jordanbaird-ice"

# Apps
cask "raycast"
cask "discord"
cask "slack"
cask "cleanshot"
cask "orbstack"
